{
  "common": {
    "name": "smartfriends",
    "version": "1.3.1",
    "news": {
      "1.3.1": {
        "en": "Dependencies were updated",
        "de": "Abhängigkeiten wurden aktualisiert",
        "ru": "Зависимости обновлялись",
        "pt": "As dependências foram atualizadas",
        "nl": "Afhankelijkheden werden bijgewerkt",
        "fr": "Mise à jour des dépendances",
        "it": "Le dipendenze sono state aggiornate",
        "es": "Se actualizaron las dependencias",
        "pl": "Zaktualizowano uzależnienia",
        "uk": "Залежність оновлено",
        "zh-cn": "附属关系得到更新"
      },
      "1.3.0": {
        "en": "Support for further device types was added\nUmlauts in device names are now correctly parsed",
        "de": "Unterstützung für weitere Gerätetypen wurde hinzugefügt\nUmlaute in Gerätenamen werden nun korrekt dargestellt",
        "ru": "Добавлена поддержка дополнительных типов устройств\nУмлауты в названиях устройств теперь правильно разобраны",
        "pt": "Foi adicionado suporte para outros tipos de dispositivos\nUmlauts em nomes de dispositivos agora são corretamente analisados",
        "nl": "Ondersteuning voor andere apparaattypes is toegevoegd\nUmlauts in apparaatnamen zijn nu correct ontleed",
        "fr": "Un soutien pour d'autres types d'appareils a été ajouté\nUmlauts dans les noms de périphériques sont maintenant correctement analysés",
        "it": "È stato aggiunto il supporto per ulteriori tipi di dispositivo\nI nomi dei dispositivi sono ora correttamente analizzati",
        "es": "Se agregó soporte para nuevos tipos de dispositivos\nUmlauts en los nombres de los dispositivos ahora se analizan correctamente",
        "pl": "Dodano wsparcie dla innych typów urządzeń\nKlauty w nazwach urządzeń są teraz poprawnie przefiltrowane",
        "uk": "Додана підтримка подальших типів пристроїв\nУмлаути в назвах пристроїв тепер правильно припаровані",
        "zh-cn": "添加了对更多设备类型的支持\n设备名称中的 Umlaut 现已正确解析"
      },
      "1.2.0": {
        "en": "Timeout for initial device request was increased\nDevices without defined device type are ignored\nRefactored device handling and added support for further device types",
        "de": "Timeout für erste Geräteanfrage wurde erhöht\nGeräte ohne definierten Gerätetyp werden ignoriert\nVerarbeitung der Geräte wurde überarbeitet und Unterstützung für weitere Gerätetypen hinzugefügt",
        "ru": "Время ожидания первоначального запроса устройства было увеличено\nУстройства без определенного типа устройства игнорируются\nРефакторированная обработка устройств и дополнительная поддержка для других типов устройств",
        "pt": "O tempo limite para a solicitação inicial do dispositivo foi aumentado\nOs dispositivos sem tipo de dispositivo definido são ignorados\nManipulação do dispositivo refatorizado e suporte adicional para outros tipos de dispositivo",
        "nl": "Tijdslimiet voor het eerste apparaatverzoek werd verhoogd\nApparaten zonder gedefinieerd apparaattype worden genegeerd\nRefactored device handling en toegevoegde ondersteuning voor andere apparaattypes",
        "fr": "Le délai pour la demande initiale d'appareil a été augmenté\nLes dispositifs sans type défini sont ignorés\nManipulation de l'appareil refactoré et support supplémentaire pour d'autres types d'appareil",
        "it": "Timeout per la richiesta iniziale del dispositivo è stato aumentato\nI dispositivi senza tipo di dispositivo definito vengono ignorati\nGestione del dispositivo e supporto aggiunto per ulteriori tipi di dispositivo",
        "es": "Se aumentó el tiempo para la solicitud inicial del dispositivo\nLos dispositivos sin tipo de dispositivo definido son ignorados\nManejo de dispositivo refactorizado y soporte añadido para nuevos tipos de dispositivos",
        "pl": "Zwiększono czas na początkowe żądanie urządzenia\nUrządzenia bez określonego typu urządzenia są ignorowane\nZmieniona obsługa urządzenia i dodana obsługa dla innych typów urządzeń",
        "uk": "Підвищено запит на початковий пристрій\nПристрої без визначеного типу пристрою ігноруються\nРефакторний пристрій обробки та додано підтримку для подальших типів пристроїв",
        "zh-cn": "初始设备请求的超时增加\n没有定义设备类型的设备会被忽略\n对设备类型进行重构处理并添加支持"
      },
      "1.1.0": {
        "en": "Refactored device handling: dynamic states, removed type whitelist, grouped devices under master ID\nHandle device value updates now correctly",
        "de": "Verarbeitung der Geräte wurde überarbeitet: dynamische Zustände, Whitelist von Gerätetypen entfernt, Geräte werden nun unter Master ID gruppiert\nGerätewert-Updates werden jetzt korrekt behandelt",
        "ru": "Рефакторированная обработка устройств: динамические состояния, удаленный белый список типов, сгруппированные устройства под идентификатором Master ID\nОбновления стоимости устройства теперь правильно",
        "pt": "Manipulação do dispositivo refatorado: estados dinâmicos, lista branca do tipo removido, dispositivos agrupados sob ID mestre\nGerenciar as atualizações de valor do dispositivo agora corretamente",
        "nl": "Refactored device handling: dynamische toestanden, verwijderd type whitelist, gegroepeerde apparaten onder master ID\nHandle apparaat waarde updates nu correct",
        "fr": "Manipulation de l'appareil refacturé : états dynamiques, liste blanche de type enlevé, dispositifs groupés sous Master ID\nGérer les mises à jour de la valeur du périphérique maintenant correctement",
        "it": "Movimentazione del dispositivo refattore: stati dinamici, tipo rimosso whitelist, dispositivi raggruppati sotto master ID\nMantenere gli aggiornamenti del valore del dispositivo ora correttamente",
        "es": "Manejo de dispositivo refactorizado: estados dinámicos, lista blanca de tipo eliminado, dispositivos agrupados bajo ID maestro\nActualizaciones de valor del dispositivo manual ahora correctamente",
        "pl": "Przekształcona obsługa urządzenia: stany dynamiczne, usunięty biały typ, zgrupowane urządzenia pod master ID\nUchwyt aktualizacji wartości urządzenia teraz poprawnie",
        "uk": "Рефакторний пристрій обробки: динамічні стани, видалений тип білий список, вбудовані пристрої під магістр ID\nОновлення значення ручного пристрою тепер правильно",
        "zh-cn": "重构设备处理: 动态状态, 删除类型白名单, 主 ID 下分组设备\n现在正确处理设备值更新"
      },
      "1.0.1": {
        "en": "Increased robustness when communicating with the gateway\nAdded new option to ignore certificate errors",
        "de": "Robustheit der Kommunikation mit dem Gateway erhöht\nNeue Option hinzugefügt, um Zertifikatsfehler zu ignorieren",
        "ru": "Повышенная надежность при общении с шлюзом\nДобавлена новая возможность игнорировать ошибки сертификата",
        "pt": "Maior robustez ao se comunicar com o gateway\nAdicionada nova opção para ignorar erros de certificado",
        "nl": "Verhoogde robuustheid bij het communiceren met de gateway\nNieuwe optie toegevoegd om certificaatfouten te negeren",
        "fr": "Une robustesse accrue lors de la communication avec la passerelle\nAjout d'une nouvelle option pour ignorer les erreurs de certificat",
        "it": "Maggiore robustezza quando si comunica con il gateway\nAggiunta nuova opzione per ignorare gli errori del certificato",
        "es": "Mayor robustez al comunicarse con la puerta de entrada\nNueva opción para ignorar errores de certificado",
        "pl": "Większa odporność podczas komunikacji z bramą\nDodano nową opcję do ignorowania błędów certyfikatu",
        "uk": "Підвищена надійність при спілкуванні з шлюзом\nДодано новий варіант ігнорувати помилки сертифіката",
        "zh-cn": "与网关沟通时的强度提高\n添加新选项以忽略证书错误"
      },
      "1.0.0": {
        "en": "initial release",
        "de": "Erstveröffentlichung",
        "ru": "Начальная версия",
        "pt": "lançamento inicial",
        "nl": "Eerste uitgave",
        "fr": "Première version",
        "it": "Versione iniziale",
        "es": "Versión inicial",
        "pl": "Pierwsze wydanie",
        "zh-cn": "首次出版",
        "uk": "початковий випуск"
      }
    },
    "titleLang": {
      "en": "SmartFriends",
      "de": "SmartFriends",
      "ru": "SmartFriends",
      "pt": "SmartFriends",
      "nl": "SmartFriends",
      "fr": "SmartFriends",
      "it": "SmartFriends",
      "es": "SmartFriends",
      "pl": "SmartFriends",
      "zh-cn": "SmartFriends",
      "uk": "SmartFriends"
    },
    "desc": {
      "en": "Local control of SmartFriends gateways and connected devices without cloud access.",
      "de": "Lokale Steuerung von SmartFriends-Gateways und angeschlossenen Geräten ohne Cloud-Anbindung.",
      "ru": "Локальное управление шлюзами SmartFriends и подключёнными устройствами без облака.",
      "pt": "Controle local de gateways SmartFriends e dispositivos conectados sem uso de nuvem.",
      "nl": "Lokale aansturing van SmartFriends-gateways en aangesloten apparaten zonder cloud.",
      "fr": "Contrôle local des passerelles SmartFriends et des appareils connectés sans cloud.",
      "it": "Controllo locale dei gateway SmartFriends e dei dispositivi collegati senza cloud.",
      "es": "Control local de gateways SmartFriends y dispositivos conectados sin nube.",
      "pl": "Lokalne sterowanie bramkami SmartFriends i podłączonymi urządzeniami bez chmury.",
      "zh-cn": "无需云服务即可本地控制 SmartFriends 网关及其连接的设备。",
      "uk": "Локальне керування шлюзами SmartFriends і підключеними пристроями без хмари."
    },
    "authors": [
      "Black-Thunder <glwars@aol.de>"
    ],
    "keywords": [
      "home automation",
      "smartfriends",
      "schellenberg"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "smartfriends.png",
    "enabled": false,
    "extIcon": "https://raw.githubusercontent.com/Black-Thunder/ioBroker.smartfriends/master/admin/smartfriends.png",
    "readme": "https://github.com/Black-Thunder/ioBroker.smartfriends/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "iot-systems",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ],
    "tier": 2
  },
  "encryptedNative": [
    "smartFriendsPassword"
  ],
  "protectedNative": [
    "smartFriendsPassword"
  ],
  "native": {
    "smartFriendsPort": 4300,
    "smartFriendsIP": "",
    "smartFriendsUsername": "",
    "smartFriendsPassword": "",
    "smartFriendsCSymbol": "D19033i",
    "smartFriendsShcVersion": "3.7.4",
    "smartFriendsShApiVersion": "3.4",
    "ignoreSslErrors": false
  },
  "objects": [],
  "instanceObjects": []
}
